{
	"blogs": [
		{
			"postTitle": "Angular",
			"postDate": "November 27, 2017",
			"postBody": "<p>I remember the first day of learning Angular. It was similar to learning jQuery for the first time. Most of the complications you run into are related to learning the new syntax. Other than that, I liked learning Angular. Having everything broken down into multiple JavaScript and HTML files really helped me to learn more about specific functions and promises, and when/where it’s best to use them.</p><p>Even though the initial setup for an angular project takes a little longer, and you have to be really careful with things like your Gruntfile and including things in your index file, I might actually prefer it over using jQuery and Browserify. However, I could definitely see my opinions on Angular waxing and waning, depending on the project and what I’m trying to accomplish, and just in general with how the development industry changes over time.</p><p>I also wanted to take this opportunity to reflect on the past 5 months, seeing as this will be my last blog post for the front-end portion of school. I still feel as strongly as I did at the beginning, if not stronger, that applying and going to NSS was the best choice for me. Naturally, part of me was afraid that I would enroll, start class, and then figure out that web development wasn’t for me, or I would get too discouraged and want to quit. I will admit that there were numerous times throughout the past few months where I questioned myself and my decision to go here. There were times where I was so depressed from the school and work grind, mixed with not being able to see my wife and kids, that I felt like I could just sit and cry for days. But thankfully, I am endowed with a fantastic support system, consisting of family and friends that truly give a damn about my well-being. I know that there will be more days ahead where my limits will be tested, but I am bound and determined to come out of this on top.</p>"
		},
		{
			"postTitle": "Theme Park Group Project",
			"postDate": "November 11, 2017",
			"postBody": "<p>For this group project, we were tasked with creating an interactive map for the Magic Kingdom at Disney World. Overall, I feel like the project went fairly well.</p><p>One major thing we did that I believe made a huge impact on our project was our efficient and robust planning. We took all the time that we needed in the planning phase, so when it came time to actual coding, there wouldn’t be any unnecessary hiccups in our process. I also feel like our communication throughout the project was really fantastic.</p><p>One thing that I feel could have been an opportunity for improvement is the way that we, specifically me, coded a few things. Mainly, the accordions for the sidebar. I think that if I made the choice to write a few simple functions to just show/hide the information on click, instead of using accordions, it would have taken less time, and would have freed me up to help out with other things. However, I am very happy with the way that it turned out, so it's kind of up in the air whether or not I would code it the same way, given a second opportunity.</p><p>So to sum it all up, I enjoyed this group project. It was a good opportunity for me to practice working with others in which their skill level varies. It also gave me a chance to relearn and practice some things that I have trouble with, such as promises and APIs.</p>"
		},
		{
			"postTitle": "Firebase",
			"postDate": "October 31, 2017",
			"postBody": "<p>For this assignment, we learned how to deploy a project using Firebase. Firebase allows you to have your data hosted and stored on the cloud, instead of having to have your own database directory in your project. Firebase also allows you to implement user login authentication, so a specific user could log in using either an email address, Google username, Facebook account, or a few other options, and be able to save changes that they made. For instance, in our Movie History assignment, a user could log in using their Google username, search for a certain movie, and save it to their movies list.</p><p>For the most part, I liked learning about implementing Firebase. I like how we now have the knowledge to allow our sites to have login authentication. One drawback that I have noticed about Firebase is that there’s a lot of steps that you have to take to make sure that everything will work correctly for you. There’s a good chance that here in the near future, I’ll be making myself a sort of “checklist” for future reference.</p>"
		},
		{
			"postTitle": "APIs",
			"postDate": "October 24, 2017",
			"postBody": "<p>I was pretty excited to learn about APIs. I knew going in that they have the ability to make things a little easier when it comes to acquiring data for your site. They can also make your site more dynamic and interesting. I also knew that APIs can kick your butt, since they’re not very easy.</p><p>It turns out there's quite a lot that goes into making an API work properly on your site or application, which was not surprising at all. It seemed like we spent a long time getting the API properly implemented in our Movie History in-class project. But once we got it working, it was very impressive to look at. I really liked how we were able to return the movie poster for whatever movie you searched for.</p><p>Another thing I liked about learning APIs was the opportunity it gave me to learn more about promises, and when/how to use them.</p><p>I’m definitely looking forward to using APIs in future class and personal projects.</p>"
		},
		{
			"postTitle": "Promises",
			"postDate": "October 17, 2017",
			"postBody": "<p>JavaScript Promises proved to be one of the more challenging concepts we’ve learned thus far (for me, at least). When it comes to writing an actual promise, it is fairly straight-forward. However, wrapping my head around what exactly a promise does turned out to be the most difficult. Another big issue I had when it came to the understanding of promises was when it is suitable to use one.</p><p>What helped me out the most when it came to fully understanding promises was simply repetition and going back to look at previous assignments. When we had to write multiple promises for each of our assignments, that helped solidify the concept in my mind. I also did a bit of outside research on the web to help myself understand some things I was foggy on.</p><p>Here are a few sites that helped me with my understanding:<br /><a href='https://developers.google.com/web/fundamentals/primers/promises'>JavaScript Promises: an Introduction</a><br /><a href='https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise'>Promise (from the MDN site)</a></p><p>Overall, after completing a few different in-class projects, homework assignments, and a group project, I have a better, more practical understanding of promises.</p>"
		},
		{
			"postTitle": "jQuery & Chatty",
			"postDate": "October 7, 2017",
			"postBody": "<p>On October 7th, we presented our second group project, which combined a few of the latest programming techniques we’ve learned. Our assignment was to, as a group, design and code a chat application, where a user could enter in a string of information in an input field, and that text would display in a “chat section” of the web page.</p><p>For this assignment, we had to break our code into separate modules, or javascript files, and use browserify techniques to make it all work. The assignment as a whole went fairly well. I got along great with my new group mates, and we were able to get our MVP completed and turned in on time. We did however hit a few bumps in the road during our assignment. One of the biggest things we realized was that we didn’t spend enough time in the planning phase. If we would have put a little bit more thought into what we wanted to accomplish, then things would have gone smoother overall. Another thing that kind of held us up was the lack of proper communication between us. There were multiple times where we wrote over each other’s code, and got merge conflicts in Github. Overall, I feel like the assignment went really well, and it was definitely a positive learning experience for the four of us.</p><p>One of the other bigger things we’ve learned recently is jQuery. I was very excited to start learning jQuery, because from everything that I’ve heard, it makes writing javascript programs much easier. However, learning jQuery proved to be a little more difficult than I originally anticipated. I think the two biggest things that held me up was learning the new syntax, and trying to “uncomplicated” the way I went about writing certain pieces of code. It turns out that there’s quite a few “duh” moments in jQuery. For instance, if you want to perform an action when you click something, the syntax is literally .click(). After having a few in-class exercises and homework assignments involving jQuery, I’m starting to get a better handle on it.</p><p>So, until next time…</p>"
		},
		{
			"postTitle": "Browserify",
			"postDate": "September 18, 2017",
			"postBody": "<p>I’m not gonna lie, browserify was kind of a nightmare. There was a LOT of new information to learn regarding browserify, and it took me a while to wrap my head around the new material. One of the most difficult things about browserify was the introduction of having different modules for all the tasks you need to complete in the assignment. Then you have to link each JavaScript module properly. It all proved to be a pretty big hurdle for me. However, after completing a few assignments, requiring us to use browserify, I am now a little more confident in my abilities to use it and not cry as much.</p><p>Let’s talk about the positives of browserify. One thing that I really like, despite what I said earlier, is how everything is broken down into multiple files/modules. Even though it was kind of a pain to learn my way around it, once I did it made the coding process a bit simpler, in a way.</p><p>I supposed that is it for now.</p>"
		},
		{
			"postTitle": "Bootstrap's Bootstraps",
			"postDate": "September 5, 2017",
			"postBody": "<p>This past week, we were introduced to Bootstrap 3. Well, several people in the class were introduced to Bootstrap 3. I, however, finally had a chance to sit back, relax, and for once not be the person who is on the verge of tears.</p><p>I have been working with Bootstrap 3 code for several years now, and have built multiple sites with it, so everything that we covered during class this past Tuesday was review for me. And now that we’ve covered Bootstrap, I can (once I have the free time) go back to all my old projects, and incorporate it into the code to make them look nicer.</p><p>On a similar note, I was very glad that I decided to not waste too much time on the CSS and stylings for my personal bio page. Once I linked the appropriate Bootstrap 3 files to my site, I was able to eliminate about 97% of my own custom CSS stylings, and just use the pre-build classes that came with Bootstrap.</p><p>There’s also been an interesting observation on my part: It seems as though there are some that either struggle with Bootstrap, or just straight-up hate it. I can definitely relate to those that are struggling with the grid layout concept, as well as some of the built-in classes; those concepts don’t really take too long to understand. But for those that hate it, I cannot relate to those individuals. I absolutely LOVE Bootstrap. Yes, it’s very true that it’s obvious when a site it powered by Bootstrap. But you really can’t argue with a free mobile-responsive CSS framework, that cuts down on the need for custom CSS, and helps to make your site all pretty and organized!</p><p>That’s pretty much all I have to say on the topic of Bootstrap. I’m sure by the time I write my next blog post, I’ll be back to being miserable again.</p>"
		},
		{
			"postTitle": "With A Little Help From My Friends",
			"postDate": "September 1, 2017",
			"postBody": "<p>For the past few weeks, we’ve been discussing XHR and using JSON files to organize arrays and objects. It definitely feels like this is the most in-depth topic in front-end development that we’ve learned thus far. With it being the most complicated topic, that also means that it’s been the most difficult for me to understand. Before you ask, the answer is still no; I have not cried yet. Have I felt like crying? You betcha. I just have to keep on telling myself that it’s not that “I don’t get it.” It’s more like “I don’t get it YET.” I’m still relatively new to front-end development, and even newer to learning it in a classroom environment.</p><p>Like I said, it took a while to wrap my head around the logic that goes into tying an array from a JSON file into your JS file; and I still have quite a while to go before I’ll be able to fully understand it. However, with a little help from my friends, I was able to go from “what the hell is going on” to “okay, this kind of makes sense.” And to me, that spells progress. It seems like one of the biggest things that is holding me up is all of the new code that I need to write, and then tying it all together. There's definitely more functions involved now, and even functions nested inside funtions (which makes things even more confusing). But it started to make sense once I could see exactly how each function relates and/or connects to another one in the code.</p><p>My next blog post will be on our discussion of Bootstrap, which will most definitely have a more positive tone. Bootstrap is my jam.</p><p>And if I don’t see ya: good afternoon, good evening, and good night.</p>"
		},
		{
			"postTitle": "Are We Having Fun Yet?",
			"postDate": "August 22, 2017",
			"postBody": "<p>Our latest venture into the programming world has been working with event listeners in JavaScript, and learning how to “code” in markdown.</p><p>My had a few first impressions of event listeners. A few of them were “holy crap, there’s a lot to this,” and “oh my God, I’m drowning in new material.” Just like anything else with JS that we’ve learned so far, event listeners have been complicated. However, I think it’s probably the most fun I’ve had with JS so far, since now there’s a certain level of interactivity on the web page. I also get the feeling that it’s going to be similar when we learn jQuery: frustrating and stress-inducing at first, but fun once I get the hang of it.</p><p>When it came down to working on solo exercises where we implemented what we’ve learned about event listeners, I still needed a bit of nudge in the right direction. But after I got that initial push, it was much easier to handle the rest of the steps in the coding exercise. I’ve come to realize that, more than likely, every week there’s going to be moments where I freak out because I don’t know what’s going on, followed by a bit of crying, followed by assistance from a friend, and wrapped up with a general understanding of what’s going on. And I think I’m ok with this.</p><p>We’ve also learned about markdown, which is a way to “code” inside your README.md file. There really isn’t much that I have to say about markdown, aside from being excited to discover that the syntax is relatively painless to learn. It can almost be compared to learning about the formatting rules that Microsoft Word implements.</p><p>Other than those two things, there’s not much else to report. I shall speak with you next week after I have my next mental breakdown!</p>"
		},
		{
			"postTitle": "It was a Bro-Down",
			"postDate": "August 14, 2017",
			"postBody": "<p>We now have our first official team exercise under our belts, and it went really well. To be honest, I’m not sure if any other group had nearly as much fun as my group did with creating/coding the project.</p><p>Our task was to come up with a fake online company that sold either real or fake products, and then utilize all of the skills we have learned thus far to complete the project. My group mates and I came up with a company called “The Brocery Store,” which sold your typical “bro” items, such as Hoverboards and vape pens.</p><p>We designed and coded 6 pages for the site; 4 of which we worked on individually, and two which we all had contributions to. I really enjoyed this project for multiple reasons. First of all, it allowed me to further hone some HTML, CSS, and JS skills. Also, it allowed us to really work as a group for the first time, where we all contributed to one final product. In the past, it always seemed like I got grouped together with people that didn’t want to be there, and half-assed their way through the exercise. But with this, everyone was highly motivated to do their best, and worked to their full potential. It was quite refreshing.</p><p>I learned a few things about working as a group on a single project. First, and probably most importantly, communication is key, just like with any kind of relationship. I feel really lucky, everyone in my group is pretty good with communicating with one another. Another thing I learned was that it pays to have a good group leader that can delegate tasks. Dre was our team leader, and he did a fantastic job of fulfilling the role. One thing that really impressed me about Dre is how he knew everyone’s skill level, and then used that knowledge with delegating tasks. For instance, if he knew that you had a stronger understanding of HTML or CSS, he urged you to take more JavaScript tasks so you have the opportunity to practice.</p><p>The last thing I’ll say about this project was that it came at a great time. We had spent quite a bit of time deep diving into some pretty complex JavaScript, so it was nice to take a short breather from learning new material. The project gave me the chance to do more work with functions, objects, arrays, and loops, which was great since I desperately needed the practice.</p><p>So, all-in-all, I had a great first experience working on a group project, and I look forward to opportunities to do more of them!</p>"
		},
		{
			"postTitle": "Chaos Is A Ladder",
			"postDate": "August 7, 2017",
			"postBody": "<p>Last week was not my week. It was pretty terrible. Between my battles with depression and learning JavaScript, I was hard to see any silver lining. However, yesterday I had a small breakthrough. I’ll repeat, it was quite small, but a breakthrough none the less.</p><p>I sat down with my group mates to try to knock out our weekly exercise, where we had to write a program that converts Fahrenheit to Celsius and vice-versa. I’d like to compare what I was struggling with to writer’s block. I literally had no clue where to start. It was like my brain was trying to translate all of the material I had recently learned, and then apply it to this exercise. So needless to say, not a whole lot got done during group study time on Saturday.</p><p>The next day, on Sunday, my group decided to meet up once more, to see if we could make any more progress. After about an hour and a half more of staring at my screen, and doing additional research on code might work, I was finally able to write some stuff down. And that stuff actually did other stuff! It was so exciting! My first breakthrough was pulling the user input degrees, and applying the math to it. Once I had that taken care of, it was relatively straight forward to get the result to print out to the page.</p><p>Unfortunately, I wasn’t able to figure out the last steps in our exercise instructions: have the result print out in certain colors, and let the user be able to use the enter key to submit the degree they want to convert. But I did make A LOT more progress on this exercise than I imagined I would, so I consider it a win.</p><p>Mic drop.</p>"
		},
		{
			"postTitle": "But I’m Really Good at Making Cookies",
			"postDate": "August 1, 2017",
			"postBody": "<p>I am entering my fourth week here at Nashville Software School. This is the image that best describes how I’m feeling right about now:</p><p><img src='img/andy.jpg' class='thumbnail' width='100%'></p><p>There have been on days and off days. There have been days where I’ve felt upbeat and positive. There have also been days, like yesterday, where it felt like I could be withering away both mentally and physically.</p><p>JavaScript has been our main focus for the last two weeks, and frankly, it has not been kind to me. It hasn’t been impossible to get through, but it’s definitely been a struggle. It almost seems as though JS is a mind-blowing magic trick: It’s very difficult to see at face value how it’s done, but once the trick is revealed to you, you almost want to slap yourself in the face for it going over your head.</p><p>However, I do feel like I’m catching on to JS programming. I’ve come to learn that it takes me a bit longer than others to understand left-brain activities like computer programming, since I’m naturally a right-brained person. Even though this kind of material makes me frustrated and pissy, I’m still glad that I’m attempting to conquer it. I know the payoff and reward will be well worth the fight.</p>"
		},
		{
			"postTitle": "JavaScript is Less Scary with Friends",
			"postDate": "July 27, 2017",
			"postBody": "<p>After only two lessons worth of JavaScript, I thought that my head was going to explode. I was thinking to myself &ldquo;Isn’t it too early in my NSS career to have a meltdown already?&rdquo; It’s becoming increasingly clearer to me that I’m going to have to put in some serious man-hours in order to be able to absorb and regurgitate this material. It’s time to pull out the big guns.</p><p>So for Wednesday of this week, I called out of work sick, and dedicated most of the day to going over what we learned in class the previous two days. I also had the opportunity to meet up with Dre from my group. I guess what they say about two heads being better than one is quite true. Together, we were able to help each other understand the material we just learned, and get a great jump on this week’s homework assignments. There were certain things that I had a hard time wrapping my head around, like for loops and using them to cycle through an array. But after my meetup with Dre, I feel like I have a much better understanding now. Not a complete understanding, but I definitely feel more confident today than I did yesterday and the two days prior.</p><p>It’s days like today where I truly believe I made the right choice in going to NSS. I feel like having the opportunity to have physical teachers to learn from (not just videos), as well as fellow classmates to consult with, is well worth the price of tuition.</p><p>Until next time&hellip;</p>"
		},
		{
			"postTitle": "Straight, No Chaser",
			"postDate": "July 25, 2017",
			"postBody": "<p>It’s the third week of class, and we’ve already managed to cover HTML, CSS, and just began JavaScript last night. If I have to assign my experience here thus far as a metaphor, it would be &ldquo;straight, no chaser.&rdquo; There was no soft opening to our JS lessons; no “ok, we’re just going to ease into this.” Simply, BANG! And we’re off to the races! I feel like I made the right decision to make friends, and make them early. A few of them came to my aid last night, when I inevitably found myself lost amongst a slew of JS code.</p><p>After class, I headed home to eat a late dinner. Afterward, I pulled my laptop back out, and I stared at the code/program that we wrote in class until it made sense. I went through it line by line until I had my own version of a &ldquo;ah-ha&rdquo; moment. It wasn’t like a lightbulb went on or anything; it was more like puzzle pieces slowing coming together, but the puzzle is still incomplete.</p><p>On a positive note, I finally finished my pre-work (the Treehouse FED track) the other day, so I have that going for me.</p><p>Tonight we’re going over objects in JavaScript, so I’m hoping that goes over well enough to where I’m not crying softly after class.</p><p>Signing off&hellip;</p>"
		},
		{
			"postTitle": "It's Ok To Cry",
			"postDate": "July 10, 2017",
			"postBody": "<p>&ldquo;What the hell have I gotten myself into?&rdquo;<br /><br />Those were the words that were ringing through my head at the end of my first “official” day at NSS. For the entirety of the evening, we sat and watched as the Evening Cohort 5 class presented their capstone projects. Much like the first day on campus just two days earlier, I was experiencing many different emotions, mostly fear and dread. For their capstone projects, the students had to take all of what they’d learned the past 5 and a half months, and apply it to making a web application. Most of what I saw was pretty impressive, so it was cool to know that in that short period of time, I would have all that wealth of information. The downside is I am going to have to learn all that information.<br /><br />Those feelings of &ldquo;fear&rdquo; and &ldquo;dread&rdquo; were conjured up thanks to those students that presented that evening. Most of them gave us new students pearls of wisdom like &ldquo;It’s ok to cry&rdquo; and &ldquo;You’re going to wish you were dead&rdquo;. I have a full-time job, a wife, two young children, and a mortgage, and I already feel dead most of the time. To be clear, when I say &ldquo;dead&rdquo;, I mean tired, not dead inside.<br /><br />What the hell have I gotten myself into?<br /><br />Sitting in my seat that night, I already had thoughts running through my head like &ldquo;I bet it's not too late to get a reimbursement on my tuition&rdquo;, and &ldquo;I wonder if they would notice if I escaped through those windows&rdquo;. The worst part of it was that I couldn’t even really turn to a fellow classmate and say &ldquo;are you as scared as I am?&rdquo; since I wasn’t really familiar with any of them yet.<br /><br />There was some light at the end of the tunnel, however. After the students were done presenting, our head instructor told us to try and not be too overwhelmed. She told us that, yes we’ll learn a lot of information in a short span of time, but we will be armed with numerous resources to aid us through the process. Resources such as group members that we can turn to, several instructors and their assistants, and plenty of opportunities to mess up and learn from our mistakes.</p>"
		},
		{
			"postTitle": "Catalyst",
			"postDate": "July 8, 2017",
			"postBody": "<p>Back to school, back to school, to prove to myself that I&rsquo;m not a fool.<br /><br />I was pretty nervous about going back to school, for several reasons. First of all, I never performed exceptionally well academically. In laymen&rsquo;s terms, I&rsquo;m kind of stupid. Well, not stupid per se, but it does take me a little while to catch on. Secondly, I was going back to school for web and software development, which is a field that I&rsquo;ve always struggled with. I love working with code, but I always found myself quickly discouraged. I would constantly hit road blocks where I didn&rsquo;t really understand what I was looking at, or what was being taught to me. But on the other hand, school WAS the silver lining. Up until now, most of my coding education has been self-taught, so I was also excited to be in an actual classroom setting, with physical teachers, surrounded by fellow classmates with more than likely the same questions I have.<br /><br />The first day of class was on Saturday, July 8th 2017. Most of the day served as an orientation to how things were going to go for the next 12 months, and what we can expect to happen. My feelings ranged from happiness, to fear, to elation, to despair, to excitement. And we hadn&rsquo;t even gotten into any of the material yet!<br /><br />Putting aside all of my personal feelings about going back to school for development, I&rsquo;d love to touch on the diversity of my classmates. This was something I was curious to learn. It&rsquo;s no big secret that the tech industry isn&rsquo;t really just for Asians, Indians, and weird looking white guys. It&rsquo;s for everyone! So I was very excited to walk into class on the first day, and see that I had struck the diversity jackpot. In fact, if I hadn&rsquo;t have known that this was a class/school for web and software development, I would have thought it was your typical general education class down at Nashville State Community College. There were folks young and old, black and white, male and female. It was genuinely really cool to know I would be a part of this learning environment.<br /><br />I left school that day with the same feelings and attitude as I did when I walked in: nervous, but excited. I&rsquo;ll be happy and content if those feelings stay the same.</p>"
		}
	]
}